#### Terraform working directory 🏠: `demo/demo-account/demo-application/rds`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.rds_instances.module.rds["rds-prd-app-1"].module.db_instance.aws_db_instance.this[0] will be updated in-place
  ~ resource "aws_db_instance" "this" {
        id                                    = "db-IOVNIUPQLCJATTMZNAAET6UVIU"
      ~ manage_master_user_password           = true -> false
      ~ performance_insights_enabled          = false -> true
      ~ performance_insights_retention_period = 0 -> 7
        tags                                  = {}
        # (51 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rds_instances.module.rds["rds-prd-app-1"].module.db_instance_replica[0].data.aws_iam_policy_document.enhanced_monitoring will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enhanced_monitoring" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + "monitoring.rds.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.rds_instances.module.rds["rds-prd-app-1"].module.db_instance_replica[0].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
